//Задача 7: Генерация случайных чисел
//Напишите лямбда-выражение, которое генерирует случайные числа.
// Используйте его для создания списка из 10 случайных чисел.
public class Main {
    public static void main(String[] args) {
        System.out.println(RandomNumber.numbers(10));
    }
}
